Revit 2027 API
PointCloudColorSettings.IsEqual Method
 Check if the contents of two settings are equal.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	PointCloudColorSettings other
)
Public Function IsEqual (
	other As PointCloudColorSettings
) As Boolean
public:
bool IsEqual(
	PointCloudColorSettings^ other
)
member IsEqual :
        other : PointCloudColorSettings -> bool
Parameters
other PointCloudColorSettings
 The settings to be compared.
Return Value
Boolean
 True for equal, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointCloudColorSettings Class
Autodesk.Revit.DB.PointClouds Namespace